#+TITLE: Bayes' Rule
#+OPTIONS: toc:nil num:nil

* Bayes' Rule

Bayes' Rule describes how to update a prior belief about some hypothesis \(H\) after observing evidence \(E\). It is the foundation of Bayesian inference: instead of asking "how likely is this data?", you ask "given this data, how should I revise my beliefs?"

\[
P(H \mid E) = \frac{P(E \mid H) \cdot P(H)}{P(E)}
\]

- \(P(H)\) — *prior*: your belief in \(H\) before seeing any evidence
- \(P(E \mid H)\) — *likelihood*: probability of observing \(E\) if \(H\) is true
- \(P(E)\) — *marginal likelihood*: total probability of \(E\) across all hypotheses
- \(P(H \mid E)\) — *posterior*: your updated belief in \(H\) after seeing \(E\)

The denominator \(P(E)\) is often expanded using the law of total probability:

\[
P(E) = P(E \mid H) \cdot P(H) + P(E \mid \neg H) \cdot P(\neg H)
\]

** Python Example

Classic medical test scenario: a disease affects 1% of the population. A test is 99% sensitive (true positive rate) and 95% specific (true negative rate). If a person tests positive, what is the probability they actually have the disease?

#+NAME: bayes-rule
#+begin_src python :results output
def bayes(prior, likelihood, false_positive_rate):
    p_evidence = likelihood * prior + false_positive_rate * (1 - prior)
    posterior = (likelihood * prior) / p_evidence
    return posterior

prior            = 0.01   # 1% prevalence
sensitivity      = 0.99   # P(positive | disease)
false_pos_rate   = 0.05   # P(positive | no disease)

posterior = bayes(prior, sensitivity, false_pos_rate)

print(f"Prior P(disease):               {prior:.2%}")
print(f"P(positive | disease):          {sensitivity:.2%}")
print(f"P(positive | no disease):       {false_pos_rate:.2%}")
print(f"Posterior P(disease | positive): {posterior:.2%}")
#+end_src

#+RESULTS: bayes-rule
: Prior P(disease):               1.00%
: P(positive | disease):          99.00%
: P(positive | no disease):       5.00%
: Posterior P(disease | positive): 16.67%
